Conf.Simple/src/InformationRegisters/SUI_tbl_label_templates/SUI_tbl_label_templates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_tbl_label_templates</name>
  <resources>
    <name>containsDM</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>height</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>isZPL</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>layout</name>
    <comment>Двоичные данные макета шаблона этикетки строкой Base64</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_tbl_label_templates/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	SUI_ИнтеграцияВКонфигурацию.УстановитьДействиеОткрытияИдентификаторов(ЭтотОбъект, "id");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_tbl_label_templates.layout
		|ИЗ
		|	РегистрСведений.SUI_tbl_label_templates КАК SUI_tbl_label_templates
		|ГДЕ
		|	SUI_tbl_label_templates.id = &id";
	
	Запрос.УстановитьПараметр("id", Запись.id);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		HTMLШаблонМакета = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(Выборка.layout.Получить()));
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура SUI_Переопределяемый_ОткрытиеИдентификатора(Элемент, СтандартнаяОбработка)
	SUI_ИнтеграцияВКонфигурациюКлиент.ОткрытиеИдентификатора(Неопределено, 
		Элемент.ТекстРедактирования, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
